//==============================================================================
/// Filename: DX11_Graphics.h
/// Description: DX11初期化
/// Copyright (C)  Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

#pragma once

#include <d3d11.h>

#include "../../framework.h"

#pragma comment(lib, "d3d11.lib")
#pragma comment(lib, "dxgi.lib")

class DX11Graphics : private NonCopyable {
public:
    //-----------------------------------------------------------------------------
    // public methods

    //-----------------------------------------------------------------------------
    /// インスタンス受け取り
    /// 
    /// \return DX11Graphics&
    //-----------------------------------------------------------------------------
    static DX11Graphics& GetInstance();


    //-----------------------------------------------------------------------------
    /// 初期化
    /// 
    /// \param [in] _hWnd ウィンドウハンドル
    /// \param [in] _width ウィンドウの横の大きさ
    /// \param [in] _height ウィンドウの縦の大きさ
    /// \return void
    //-----------------------------------------------------------------------------
    bool Init(
        /*[in]*/HWND _hWnd ,
        /*[in]*/const unsigned int _width ,
        /*[in]*/const unsigned int _height);

    //-----------------------------------------------------------------------------
    /// 描画の前処理
    /// 
    /// \retrun void
    //-----------------------------------------------------------------------------
    void BeforeRender();


    //-----------------------------------------------------------------------------
    /// 描画の後処理
    /// 
    /// \retrun void
    //-----------------------------------------------------------------------------
    void AfterRender();

    //-----------------------------------------------------------------------------
    /// 解放処理
    /// 
    /// \return void
    //-----------------------------------------------------------------------------
    void Exit();

    //-----------------------------------------------------------------------------
    /// デバイス取得
    /// 
    /// \return ID3D11Device*
    //-----------------------------------------------------------------------------
    ID3D11Device* GetDXDevice() const;

    //-----------------------------------------------------------------------------
    /// デバイスコンテキスト取得
    /// 
    /// \return GetDeviceContext*
    //-----------------------------------------------------------------------------
    ID3D11DeviceContext* GetDeviceContext() const;


    //-----------------------------------------------------------------------------
    /// スワップチェイン取得
    /// 
    /// \return IDXGISwapChain*
    //-----------------------------------------------------------------------------
    IDXGISwapChain* GetSwapChain() const;

    //-----------------------------------------------------------------------------
    /// レンダーターゲットビュー取得
    /// 
    /// \return ID3D11RenderTargetView*
    //-----------------------------------------------------------------------------
    ID3D11RenderTargetView* GetBackBufferPort() const;

    //-----------------------------------------------------------------------------
    /// ビューポート
    /// 
    /// \return ID3D11RenderTargetView*
    //-----------------------------------------------------------------------------
    D3D11_VIEWPORT GetViewPort() const;

    //-----------------------------------------------------------------------------
    /// バックバッファの縦の大きさ 取得
    /// 
    /// \return int
    //-----------------------------------------------------------------------------
    int GetViewPortHeight() const;

    //-----------------------------------------------------------------------------
    /// バックバッファの横の大きさ 取得
    /// 
    /// \return int
    //-----------------------------------------------------------------------------
    int GetViewPortWidth() const;

    //-----------------------------------------------------------------------------

private:
    //-----------------------------------------------------------------------------
    // private methods

    //-----------------------------------------------------------------------------
    ComPtr<ID3D11Device> m_pDevice;
    ComPtr<ID3D11DeviceContext> m_PdeviceContext;
    ComPtr<IDXGISwapChain> m_pSwapChain;
    ComPtr<ID3D11RenderTargetView> m_pBackBufferView;
    D3D11_VIEWPORT m_viewport;
    int m_width = 0;
    int m_height = 0;
    float m_backGroundColor[4] = { 1.0f , 0.2f , 0.2f , 1.0f };
    ///<
    /// m_pDevice デバイス
    /// m_pDeviceContext デバイスコンテキスト
    /// m_pSwapChain スワップチェイン
    /// m_pBackBufferView レンダーターゲットビュー
    /// m_viewport ビューポート
    /// m_width バックバッファの横の大きさ 
    /// m_height バックバッファの縦の大きさ 
    ///

    //-----------------------------------------------------------------------------
};
